Backrooms/src/Catalogs/Аудитории/Аудитории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аудитории</name>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.ЗданияОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДосокИПроекторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Микрофонов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийКоворкинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщедоступныйКоворкинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОткрытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗакрытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/Catalogs/Аудитории/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ГрафикРаботыВыходнойПриИзмененииНаСервере()
	Инд = Элементы.ГрафикРаботы.ТекущаяСтрока;
	Если Объект.ГрафикРаботы[Инд].Выходной Тогда
		Объект.ГрафикРаботы[Инд].ВремяОткрытия = '00010101 12:00:00';
		Объект.ГрафикРаботы[Инд].ВремяЗакрытия = '00010101 12:00:00';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыВыходнойПриИзменении(Элемент)
	ГрафикРаботыВыходнойПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()
	Объект.ГрафикРаботы.Очистить();
	Объект.ГрафикРаботы.Загрузить(Объект.Здание.ВремяРаботыПоУмолчанию.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ЗданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
КонецПроцедуры
